In [1]:
import pandas as pd  
import numpy as np

* dataframe:Collection of series.
* To create DataFrame:List,dict,read_csv,etc.

In [3]:
# using List 
Lt=[['A','B','C','D'],[44,25,74,55]]
Lt
pd.DataFrame(Lt)
pd.DataFrame(Lt,columns=['sum','mon','tue','wed'])

  sum mon tue wed
0   A   B   C   D
1  44  25  74  55

In [4]:
#Using Dictionary
Dt={'Name':['amit','rohan','mohan','aman'],'Score':[23,42,54,55]}
Dt
pd.DataFrame(Dt)

    Name  Score
0   amit     23
1  rohan     42
2  mohan     54
3   aman     55

In [5]:
df=pd.read_csv("D:/Ad_py_lib.csv/ml_csv/house.csv")
df

,POSTED_BY,UNDER_CONSTRUCTION,RERA,BHK_NO.,BHK_OR_RK,SQUARE_FT,READY_TO_MOVE,RESALE,ADDRESS,LONGITUDE,LATITUDE,TARGET(PRICE_IN_LACS)
0,Owner,0,0,2,BHK,1300.236407,1,1,"Ksfc Layout,Bangalore",12.969910,77.597960,55.0
1,Dealer,0,0,2,BHK,1275.000000,1,1,"Vishweshwara Nagar,Mysore",12.274538,76.644605,51.0
2,Owner,0,0,2,BHK,933.159722,1,1,"Jigani,Bangalore",12.778033,77.632191,43.0
3,Owner,0,1,2,BHK,929.921143,1,1,"Sector-1 Vaishali,Ghaziabad",28.642300,77.344500,62.5
4,Dealer,1,0,2,BHK,999.009247,0,1,"New Town,Kolkata",22.592200,88.484911,60.5
...,...,...,...,...,...,...,...,...,...,...,...,...
29446,Owner,0,0,3,BHK,2500.000000,1,1,"Shamshabad Road,Agra",27.140626,78.043277,45.0
29447,Owner,0,0,2,BHK,769.230769,1,1,"E3-108, Lake View Recidency,,Vapi",39.945409,-86.150721,16.0
29448,Dealer,0,0,2,BHK,1022.641509,1,1,"Ajmer Road,Jaipur",26.928785,75.828002,27.1
29449,Owner,0,0,2,BHK,927.079009,1,1,"Sholinganallur,Chennai",12.900150,80.227910,67.0
29450,Dealer,0,1,2,BHK,896.774194,1,1,"Jagatpura,Jaipur",26.832353,75.841749,27.8

In [6]:
import sys
print(sys.getsizeof(df))

7309351

In [7]:
df.size

353412

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df.dtypes

POSTED_BY                 object
UNDER_CONSTRUCTION         int64
RERA                       int64
BHK_NO.                    int64
BHK_OR_RK                 object
SQUARE_FT                float64
READY_TO_MOVE              int64
RESALE                     int64
ADDRESS                   object
LONGITUDE                float64
LATITUDE                 float64
TARGET(PRICE_IN_LACS)    float64
dtype: object

In [10]:
df.shape

(29451, 12)

In [11]:
df.columns

Index(['POSTED_BY', 'UNDER_CONSTRUCTION', 'RERA', 'BHK_NO.', 'BHK_OR_RK',
       'SQUARE_FT', 'READY_TO_MOVE', 'RESALE', 'ADDRESS', 'LONGITUDE',
       'LATITUDE', 'TARGET(PRICE_IN_LACS)'],
      dtype='object')

In [12]:
df['POSTED_BY']

0         Owner
1        Dealer
2         Owner
3         Owner
4        Dealer
          ...
29446     Owner
29447     Owner
29448    Dealer
29449     Owner
29450    Dealer
Name: POSTED_BY, Length: 29451, dtype: object

In [13]:
type(df['POSTED_BY'])

pandas.core.series.Series

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
print(df['POSTED_BY'].dtype)

object

In [16]:
print(df['RERA'].dtype)

int64

In [17]:
df['RERA'].astype('int32')
df['RERA']=df['RERA'].astype('int32')
print(df['RERA'].dtype)

int32

In [18]:
import sys
print(sys.getsizeof(df))

7191547

In [19]:
# import pandas as pd

# print(df.memory_usage())

In [20]:
# total = df.memory_usage(deep=True).sum()
# print("Total memory used:", total, "bytes")

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29451 entries, 0 to 29450
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   POSTED_BY              29451 non-null  object
 1   UNDER_CONSTRUCTION     29451 non-null  int64
 2   RERA                   29451 non-null  int32
 3   BHK_NO.                29451 non-null  int64
 4   BHK_OR_RK              29451 non-null  object
 5   SQUARE_FT              29451 non-null  float64
 6   READY_TO_MOVE          29451 non-null  int64
 7   RESALE                 29451 non-null  int64
 8   ADDRESS                29451 non-null  object
 9   LONGITUDE              29451 non-null  float64
 10  LATITUDE               29451 non-null  float64
 11  TARGET(PRICE_IN_LACS)  29451 non-null  float64
dtypes: float64(4), int32(1), int64(4), object(3)
memory usage: 2.6+ MB

In [22]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
UNDER_CONSTRUCTION,29451.0,0.179756,3.839908e-01,0.000000,0.000000,0.000000,0.000000,1.000000e+00
RERA,29451.0,0.317918,4.656753e-01,0.000000,0.000000,0.000000,1.000000,1.000000e+00
BHK_NO.,29451.0,2.392279,8.790913e-01,1.000000,2.000000,2.000000,3.000000,2.000000e+01
SQUARE_FT,29451.0,19802.170190,1.901335e+06,3.000000,900.021130,1175.056750,1550.688124,2.545455e+08
READY_TO_MOVE,29451.0,0.820244,3.839908e-01,0.000000,1.000000,1.000000,1.000000,1.000000e+00
RESALE,29451.0,0.929578,2.558613e-01,0.000000,1.000000,1.000000,1.000000,1.000000e+00
LONGITUDE,29451.0,21.300255,6.205306e+00,-37.713008,18.452663,20.750000,26.900926,5.991288e+01
LATITUDE,29451.0,76.837695,1.055775e+01,-121.761248,73.798100,77.324137,77.828740,1.529627e+02
TARGET(PRICE_IN_LACS),29451.0,142.898746,6.568807e+02,0.250000,38.000000,62.000000,100.000000,3.000000e+04

In [23]:
df.ndim

2

In [24]:
df.shape

(29451, 12)

In [25]:
# Return the required values
n=[10,3,53,44,64,35,74,6,3,53,16]
dt=pd.DataFrame(n,columns=['score'])

In [26]:
dt.duplicated().sum()

np.int64(2)

In [27]:
dt

    score
0      10
1       3
2      53
3      44
4      64
5      35
6      74
7       6
8       3
9      53
10     16

In [28]:
dt['score'].between(10,64)

0      True
1     False
2      True
3      True
4      True
5      True
6     False
7     False
8     False
9      True
10     True
Name: score, dtype: bool

In [29]:
dt[dt['score'].between(10,64)]

    score
0      10
2      53
3      44
4      64
5      35
9      53
10     16

In [30]:
dt[dt['score'].between(10,64)].count()

score    7
dtype: int64

In [31]:
dt[dt['score'].between(10,64)].sum()

score    275
dtype: int64

In [32]:
dt.drop_duplicates()#delele last duplicates value.

    score
0      10
1       3
2      53
3      44
4      64
5      35
6      74
7       6
10     16

In [33]:
dt.drop_duplicates(keep='last')#delele first duplicate value and keep last duplicate value.

    score
0      10
3      44
4      64
5      35
6      74
7       6
8       3
9      53
10     16

In [34]:
dt.duplicated().sum()

np.int64(2)

In [40]:
Lt=[23,43,20,50,45,28,54]
dt=pd.DataFrame(Lt)
# print(dt)
(dt==20) | (dt==50) | (dt==23)  #return row booleans(True,False)

       0
0   True
1  False
2   True
3   True
4  False
5  False
6  False

In [39]:
Lt=[23,43,20,50,45,28,54]
dt=pd.DataFrame(Lt)
# print(dt)
dt[(dt==20) | (dt==50) | (dt==23)] #return values with row index

      0
0  23.0
1   NaN
2  20.0
3  50.0
4   NaN
5   NaN
6   NaN

In [41]:
dt[0]

0    23
1    43
2    20
3    50
4    45
5    28
6    54
Name: 0, dtype: int64

In [42]:
dt.isin([20,50,13]) #use build in functions

       0
0  False
1  False
2   True
3   True
4  False
5  False
6  False

In [43]:
dt[dt.isin([20,50,23])]

      0
0  23.0
1   NaN
2  20.0
3  50.0
4   NaN
5   NaN
6   NaN

In [51]:
Lt=[[23,21,np.nan,np.nan],[60,78,93,78]]
df=pd.DataFrame(Lt,columns=['1st','2nd','3rd','4th'])
df

   1st  2nd   3rd   4th
0   23   21   NaN   NaN
1   60   78  93.0  78.0

In [73]:
Lt=[[23,21,np.nan,np.nan],[60,78,np.nan,78],[75,np.nan,np.nan]]
df=pd.DataFrame(Lt,columns=['1st','2nd','3rd','4th'])
df

# df.dropna(how='all')  #drop row if all row is NaN.  #dropna has 
# df.dropna()  #drop row if any one row is NaN.
# df.dropna(subset=['1st','4th']) #drop particular row by the help of columns name
# df.dropna(ignore_index=0,subset=['1st','4th'])

   1st   2nd  3rd   4th
0   23  21.0  NaN   NaN
1   60  78.0  NaN  78.0
2   75   NaN  NaN   NaN

In [71]:
# df.fillna(0,inplace=True) #inplace used used to change the value in original value or dataset.

In [72]:
# df

   1st   2nd  3rd   4th
0   23  21.0  0.0   0.0
1   60  78.0  0.0  78.0
2   75   0.0  0.0   0.0

In [75]:
df.fillna(df.mean())

   1st   2nd  3rd   4th
0   23  21.0  NaN  78.0
1   60  78.0  NaN  78.0
2   75  49.5  NaN  78.0

In [2]:
dc={'Name':['A','B','C','D'],'Score':[53,27,86,43],'Address':['Bhopal','Indore','Delhi','Ujjain']}
df=pd.DataFrame(dc)

In [3]:
df

  Name  Score Address
0    A     53  Bhopal
1    B     27  Indore
2    C     86   Delhi
3    D     43  Ujjain

In [4]:
df['Name'] # it work on columns.

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [5]:
df.iloc[0] #iloc is used for row indexing extraction,And only for numeric value.

Name            A
Score          53
Address    Bhopal
Name: 0, dtype: object

In [6]:
df

  Name  Score Address
0    A     53  Bhopal
1    B     27  Indore
2    C     86   Delhi
3    D     43  Ujjain

In [18]:
dc={'Name':['A','B','C','D'],'Score':[53,27,86,43],'Address':['Bhopal','Indore','Delhi','Ujjain']}
ddf=pd.DataFrame(dc)

In [19]:
ddf

  Name  Score Address
0    A     53  Bhopal
1    B     27  Indore
2    C     86   Delhi
3    D     43  Ujjain

In [20]:
ddf.set_index('Name',inplace=True)

In [21]:
ddf

      Score Address
Name
A        53  Bhopal
B        27  Indore
C        86   Delhi
D        43  Ujjain

In [24]:
ddf.iloc[0] #iloc for integer values.

Score          53
Address    Bhopal
Name: A, dtype: object

In [25]:
ddf.loc['A']  #loc for str values.

Score          53
Address    Bhopal
Name: A, dtype: object

In [26]:
ddf.reset_index(inplace=True) #return to the last dataset formate.

In [27]:
ddf

  Name  Score Address
0    A     53  Bhopal
1    B     27  Indore
2    C     86   Delhi
3    D     43  Ujjain

In [28]:
df.iloc[0]

Name            A
Score          53
Address    Bhopal
Name: 0, dtype: object

In [29]:
df['Name']

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [37]:
l=[19,3,4,2,5,6]
l

[19, 3, 4, 2, 5, 6]

In [38]:
fq=pd.DataFrame(l)
print(fq.mean())
print(fq.median())
print(fq.var())
print(fq.corr())

0    6.5
dtype: float64
0    4.5
dtype: float64
0    39.5
dtype: float64
     0
0  1.0

In [39]:
fq.describe().T

   count  mean       std  min   25%  50%   75%   max
0    6.0   6.5  6.284903  2.0  3.25  4.5  5.75  19.0

In [4]:
df1=pd.read_excel("C:/Users/sawsu/OneDrive/Desktop/test/Book1.xlsx")

In [5]:
df1

     day    city weather  temp  windspeed
0  45292  bhopal     fog  31.0       10.0
1  45324  indore   sunny  22.0        4.0
2  45354  bhopal   rainy  32.0       18.0
3  45386  bhopal     fog  39.0       16.0
4  45417  indore   sunny  30.0        5.0
5  45449  bhopal   rainy  35.0       20.0
6  45480  ujjain   sunny  38.0        3.0
7  45512  ujjain   rainy  32.0       17.0
8  45544  ujjain     fog   NaN        NaN

In [6]:
ct=df1.groupby('city')
# ct=df1.groupby(['city','weather'])

In [7]:
for c,city in ct:
    print(c)     #combine splite bind
    print(city)

bhopal
     day    city weather  temp  windspeed
0  45292  bhopal     fog  31.0       10.0
2  45354  bhopal   rainy  32.0       18.0
3  45386  bhopal     fog  39.0       16.0
5  45449  bhopal   rainy  35.0       20.0
indore
     day    city weather  temp  windspeed
1  45324  indore   sunny  22.0        4.0
4  45417  indore   sunny  30.0        5.0
ujjain
     day    city weather  temp  windspeed
6  45480  ujjain   sunny  38.0        3.0
7  45512  ujjain   rainy  32.0       17.0
8  45544  ujjain     fog   NaN        NaN

In [20]:
# ct.get_group('bhopal')
ct.get_group('bhopal').apply(min)

day           45292
city         bhopal
weather         fog
temp           23.0
windspeed      10.0
dtype: object

In [2]:
# def cybrom(v):
#     return v > 18
# ct['wind'].apply(cybrom)
# ct.apply(cybrom)

In [8]:
ct.agg(['sum','min','max'])

           day                         weather                 temp        \
           sum    min    max               sum    min    max    sum   min
city
bhopal  181481  45292  45449  fograinyfograiny    fog  rainy  137.0  31.0
indore   90741  45324  45417        sunnysunny  sunny  sunny   52.0  22.0
ujjain  136536  45480  45544     sunnyrainyfog    fog  sunny   70.0  32.0

             windspeed
         max       sum   min   max
city
bhopal  39.0      64.0  10.0  20.0
indore  30.0       9.0   4.0   5.0
ujjain  38.0      20.0   3.0  17.0

In [10]:
len(ct)  #return the length of group mode in grouping.

3

In [14]:
# concat 
df2=pd.DataFrame([10,22,15,15,28])   
df3=pd.DataFrame([28,26,23,38,36])
pd.concat([df2,df3],ignore_index=True)
pd.concat([df2,df3],ignore_index=True,axis=1)   #to change dimentionality one D to 2D or more.

    0   1
0  10  28
1  22  26
2  15  23
3  15  38
4  28  36

In [25]:
#Multiindex
df1=pd.DataFrame({"Name":["Amit"],"Score":[96]})
df2=pd.DataFrame({'Score':[87],"Address":["Bhopal"]})
# print(df1)
# print(df2)
pd.concat([df1,df2],ignore_index=True) 
# pd.concat([df1,df2],join='inner',ignore_index=True) #add those columns which have two or more time comes in dataset

   Score
0     96
1     87

In [28]:
df2=pd.DataFrame([10,22,15,15,28])   
df3=pd.DataFrame([28,26,23,38,36])
pd.concat([df2,df3],keys=["gsdfd","dfdss"])  #multi indexing

          0
gsdfd 0  10
      1  22
      2  15
      3  15
      4  28
dfdss 0  28
      1  26
      2  23
      3  38
      4  36

In [3]:
import numpy as np 
import pandas as pd  
import matplotlib.pyplot as plt 
import seaborn as sns

In [51]:
df= pd.read_csv("D:/Ad_py_lib.csv/pandas_and_numpy/pandas_data.csv")

In [52]:
df

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [54]:
import sys
sys.getsizeof(df)

1048842

In [28]:
df.ndim

2

In [29]:
df.duplicated().sum

<bound method Series.sum of 0       False
1       False
2       False
3       False
4       False
        ...
4617    False
4618    False
4619    False
4620    False
4621    False
Length: 4622, dtype: bool>

In [30]:
df.shape

(4622, 5)

In [31]:
df.size

23110

In [33]:
df.isnull().sum

<bound method DataFrame.sum of       order_id  quantity  item_name  choice_description  item_price
0        False     False      False                True       False
1        False     False      False               False       False
2        False     False      False               False       False
3        False     False      False                True       False
4        False     False      False               False       False
...        ...       ...        ...                 ...         ...
4617     False     False      False               False       False
4618     False     False      False               False       False
4619     False     False      False               False       False
4620     False     False      False               False       False
4621     False     False      False               False       False

[4622 rows x 5 columns]>

In [34]:
type(df)

pandas.core.frame.DataFrame

In [35]:
df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [44]:
df['order_id']=df['order_id'].astype('int32')

In [45]:
df['quantity']=df['quantity'].astype('int32')

In [47]:
print(df.dtypes['order_id'])
print(df.dtypes['quantity'])

int32
int32

In [49]:
import sys
sys.getsizeof(df)

1011866

In [55]:
df.info

<bound method DataFrame.info of       order_id  quantity                              item_name  \
0            1         1           Chips and Fresh Tomato Salsa
1            1         1                                   Izze
2            1         1                       Nantucket Nectar
3            1         1  Chips and Tomatillo-Green Chili Salsa
4            2         2                           Chicken Bowl
...        ...       ...                                    ...
4617      1833         1                          Steak Burrito
4618      1833         1                          Steak Burrito
4619      1834         1                     Chicken Salad Bowl
4620      1834         1                     Chicken Salad Bowl
4621      1834         1                     Chicken Salad Bowl

                                     choice_description item_price
0                                                   NaN     $2.39
1                                          [Clementine]     $3.39
2                                               [Apple]     $3.39
3                                                   NaN     $2.39
4     [Tomatillo-Red Chili Salsa (Hot), [Black Beans...    $16.98
...                                                 ...        ...
4617  [Fresh Tomato Salsa, [Rice, Black Beans, Sour ...    $11.75
4618  [Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...    $11.75
4619  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...    $11.25
4620  [Fresh Tomato Salsa, [Fajita Vegetables, Lettu...     $8.75
4621  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...     $8.75

[4622 rows x 5 columns]>